app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["first_name", "test 2_pepe 2"], ["updated_at", "2021-10-04 20:28:18.274590"], ["id", 11]]